Тест1/src/InformationRegisters/ЗначенияПоказателейСотрудников/ЗначенияПоказателейСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияПоказателейСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПоказателиСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест1/src/Catalogs/ПрофилиПоказателей/ПрофилиПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофилиПоказателей</name>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мотивация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОформленияПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортКемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортКодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СемейноеПоложение</name>
    <type>
      <types>EnumRef.СемейноеПоложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ВоинскаяОбязанность</name>
    <type>
      <types>EnumRef.ВоинскаяОбязанность</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБанковскойКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефонаДляПлатежей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРаботы</name>
    <type>
      <types>CatalogRef.МестоРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Штатный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольДляУК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьДляУК</name>
    <type>
      <types>CatalogRef.ДолжностиДляУК</types>
    </type>
  </attributes>
  <attributes>
    <name>Тележка</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоДополнительный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Дети</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПомощникиМенеджера</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиWT10</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.ДолжностиДляУК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/CommonModules/дт_ПоказателиСотрудников/Module.bsl
#Область ПрограммныйИнтерфейс
 
 Процедура ЗаполнитьПоказателиСотрудников(ТаблицаСотрудники, Отказ = Ложь) Экспорт
 	
 	Запрос = Новый Запрос;
 	Запрос.Текст =
 		"ВЫБРАТЬ
 		|	ВременнаяТаблица.Сотрудник,
 		|	ВременнаяТаблица.Подразделение,
 		|	ВременнаяТаблица.Должность
 		|ПОМЕСТИТЬ втСотрудники
 		|ИЗ
 		|	&ВременнаяТаблица КАК ВременнаяТаблица
 		|;
 		|
 		|////////////////////////////////////////////////////////////////////////////////
 		|ВЫБРАТЬ
 		|	втСотрудники.Сотрудник,
 		|	ДолжностиПредприятия.ПрофильПоказателей
 		|ПОМЕСТИТЬ втПрофилиСотрудников
 		|ИЗ
 		|	Справочник.ДолжностиПредприятия КАК ДолжностиПредприятия
 		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСотрудники КАК втСотрудники
 		|		ПО втСотрудники.Должность = ДолжностиПредприятия.Ссылка
 		|		И ДолжностиПредприятия.ПрофильПоказателей <> ЗНАЧЕНИЕ(Справочник.ПрофилиПоказателей.ПустаяСсылка)
 		|;
 		|
 		|////////////////////////////////////////////////////////////////////////////////
 		|ВЫБРАТЬ
 		|	ПрофилиПоказателейПоказатели.Показатель,
 		|	втПрофилиСотрудников.Сотрудник КАК Сотрудник
 		|ИЗ
 		|	Справочник.ПрофилиПоказателей.Показатели КАК ПрофилиПоказателейПоказатели
 		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПрофилиСотрудников КАК втПрофилиСотрудников
 		|		ПО втПрофилиСотрудников.ПрофильПоказателей = ПрофилиПоказателейПоказатели.Ссылка
 		|ИТОГИ
 		|ПО
 		|	Сотрудник";
 	
 	Запрос.УстановитьПараметр("ВременнаяТаблица", ТаблицаСотрудники);
 	
 	РезультатЗапроса = Запрос.Выполнить();
 	
 	ВыборкаСотрудник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
 	
 	НачатьТранзакцию();
 	
 	Пока ВыборкаСотрудник.Следующий() Цикл
 		
		Спр = ВыборкаСотрудник.Сотрудник.ПолучитьОбъект();
		
		Попытка
			Спр.Заблокировать();
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Отказ = Истина;
			Прервать;
		КонецПопытки;
		
		СтрокиКУдалению = Спр.Показатели.НайтиСтроки(Новый Структура("ЭтоДополнительный", Ложь));
		Для Индекс = 0 По СтрокиКУдалению.Количество() - 1 Цикл
			Спр.Показатели.Удалить(СтрокиКУдалению[Индекс]);
		КонецЦикла;
		
 	
 		ВыборкаДетальныеЗаписи = ВыборкаСотрудник.Выбрать();
 	
 		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 			НоваяСтрока = Спр.Показатели.Добавить();
 			НоваяСтрока.Показатель = ВыборкаДетальныеЗаписи.Показатель;
 		КонецЦикла;
 		
 		Попытка
 			Спр.Записать();
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Отказ = Истина;
			Прервать;
		КонецПопытки;
 			
 		
 	КонецЦикла;
 	
 	Если ТранзакцияАктивна() Тогда
 		Если Отказ Тогда
 			ОтменитьТранзакцию();
 		Иначе
 			ЗафиксироватьТранзакцию();
 		КонецЕсли;
 	КонецЕсли;
 	
 	Если Отказ Тогда
 		ВызватьИсключение ТекстОшибки;
 	КонецЕсли;
 	
 КонецПроцедуры
 
 
 Функция ПоказателиУстановлены(Сотрудник = Неопределено, Дата = Неопределено) Экспорт
 	
 	Если Сотрудник = Неопределено Тогда
 		Сотрудник = дт_Сотрудники.СотрудникПоПользователю(Пользователи.ТекущийПользователь());
 	КонецЕсли;
 	
 	Если Дата = Неопределено Тогда
 		Дата = ТекущаяДатаСеанса();
 	КонецЕсли;
 	
 	
 	Запрос = Новый Запрос;
 	Запрос.Текст =
 		"ВЫБРАТЬ
 		|	СотрудникиПоказатели.Показатель,
 		|	СотрудникиПоказатели.Ссылка
 		|ПОМЕСТИТЬ вПоказателиСотрудника
 		|ИЗ
 		|	Справочник.Сотрудники.Показатели КАК СотрудникиПоказатели
 		|ГДЕ
 		|	СотрудникиПоказатели.Ссылка = &Сотрудник
 		|;
 		|
 		|////////////////////////////////////////////////////////////////////////////////
 		|ВЫБРАТЬ
 		|	вПоказателиСотрудника.Показатель
 		|ИЗ
 		|	вПоказателиСотрудника КАК вПоказателиСотрудника
 		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейСотрудников КАК ЗначенияПоказателейСотрудников
 		|		ПО ЗначенияПоказателейСотрудников.Сотрудник = вПоказателиСотрудника.Ссылка
 		|		И вПоказателиСотрудника.Показатель = ЗначенияПоказателейСотрудников.Показатель
 		|		И ЗначенияПоказателейСотрудников.Период = &Период
 		|ГДЕ
 		|	ЗначенияПоказателейСотрудников.Значение ЕСТЬ NULL";
 	
 	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
 	Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
 	
 	РезультатЗапроса = Запрос.Выполнить();
 	
 	Возврат РезультатЗапроса.Пустой();
 	
 КонецФункции
 
 Функция ПолучитьВремяУстановкиПоказателей() Экспорт
 	Возврат Константы.дт_ВремяУстановкиПоказателейСотрудников.Получить();
 КонецФункции
 
 #КонецОбласти
 
 #Область СлужебныйПрограммныйИнтерфейс
 
 
 
 #КонецОбласти
 
 #Область СлужебныеПроцедурыИФункции
 
 
 
 #КонецОбласти
